In [16]:
import pandas as pd
import numpy as np

In [17]:
data={'kor':[10,30,50,70],'eng':[20,40,60,80],
     'math':[33,44,55,66]}  #키값이 리스트인 경우
df =pd.DataFrame(data,index=['aa','bb','cc','dd'])
df

    kor  eng  math
aa   10   20    33
bb   30   40    44
cc   50   60    55
dd   70   80    66

In [6]:
df+2 # 전체 데이터에 +2된 새로운 데이터프레임이 반환  df자체가 +2이 된것이 아니다

    kor  eng  math
aa   12   22    35
bb   32   42    46
cc   52   62    57
dd   72   82    68

In [7]:
df

    kor  eng  math
aa   10   20    33
bb   30   40    44
cc   50   60    55
dd   70   80    66

In [8]:
df= df+2
df

    kor  eng  math
aa   12   22    35
bb   32   42    46
cc   52   62    57
dd   72   82    68

In [9]:
df['kor']+2 # 'kor' col에 대해 +2  새로운 시리즈객체가 반환 'kor' col 자체가 변형인 된 것이 아니다

aa    14
bb    34
cc    54
dd    74
Name: kor, dtype: int64

In [10]:
df['kor']=df['kor']+2     
df

    kor  eng  math
aa   14   22    35
bb   34   42    46
cc   54   62    57
dd   74   82    68

In [11]:
df['kor'] =[1,2,3,4]  # col 칼럼의 값변경  df자체가 바뀐다  # == pd.Series([1,2,3,4])
df

    kor  eng  math
aa    1   22    35
bb    2   42    46
cc    3   62    57
dd    4   82    68

In [12]:
#df.iloc[0:2,1:] = 3                  # 3으로 값 바꿈
df.iloc[0:2,1:]=df.iloc[0:2,1:]+3     # 원래데이터에 +3
df

    kor  eng  math
aa    1   25    38
bb    2   45    49
cc    3   62    57
dd    4   82    68

#관계연산자

In [13]:
df[[True,False,False,True]]   #row boolean index  ****데이터 프레임의 불리언 인덱싱은 row다!****

    kor  eng  math
aa    1   25    38
dd    4   82    68

In [14]:
# df['kor']>20 # row 단위로 반환
df[df['kor']>20] #' kor' 의 값중 20보다 큰 애들을 선택해서 row를 보여줌

Empty DataFrame
Columns: [kor, eng, math]
Index: []

In [30]:
df[(df['kor']==10)|(df['kor']==30)]['kor']

aa    10
bb    30
Name: kor, dtype: int64

In [19]:
df.query('kor>20') # == df[df.kor>70]

    kor  eng  math
bb   30   40    44
cc   50   60    55
dd   70   80    66

In [24]:
df.query('kor==10 or kor ==30')

    kor  eng  math
aa   10   20    33
bb   30   40    44

In [27]:
df.query('kor>=10 and kor<=30')

    kor  eng  math
aa   10   20    33
bb   30   40    44

In [32]:
df.drop('bb') # df자체가 삭제된것이 아님
#df= df.drop('bb')# df 자체에 'bb'가 삭제됨 
#df.drop('bb',inplace=True) # df 자체에 'bb'가 삭제됨

    kor  eng  math
aa   10   20    33
cc   50   60    55
dd   70   80    66

In [35]:
#복수개 삭제
#df.drop(['aa','cc'])
#df.loc['aa':'cc'] # df= df.loc['aa':'cc'] ='dd'가 삭제된것과 같다
df.drop(['kor','eng'] , axis=1) # axis= 1 = col  axis 0 = row

    eng  math
aa   20    33
bb   40    44
cc   60    55
dd   80    66